// #############################################################################
// # Types
// #############################################################################

type Project = [
  string[],
  {
    image: string;
    name: string;
    subject: string;
    category: string[];
    status: string;
    tags: string[];
    href: string;
  }[],
];

// #############################################################################
// # Data
// #############################################################################

export const PROJECTS: Project = [
  [
    "همه نمونه‌ها",
    "نوآوری",
    "سلامت",
    "سرمایه‌گذاری",
    "کشف و خلق",
    "توسعه",
    "تجاری‌سازی",
    "سرمایه‌گذاری",
  ],
  [
    {
      image: "/images/project.jpg",
      name: "ریشــــه",
      subject: "پلتفرم یکپارچه خدمات سالمندی",
      category: ["نوآوری", "سلامت"],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "/portfolio/root",
    },
    {
      image: "/images/project.jpg",
      name: "لورم ایپسوم",
      subject: "لورم ایپسوم متن ساختگی",
      category: ["نوآوری", "سلامت"],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "#",
    },
    {
      image: "/images/project.jpg",
      name: "لورم ایپسوم",
      subject: "لورم ایپسوم متن ساختگی",
      category: ["نوآوری", "سلامت"],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "#",
    },
    {
      image: "/images/project.jpg",
      name: "لورم ایپسوم",
      subject: "لورم ایپسوم متن ساختگی",
      category: ["نوآوری", "سلامت"],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "#",
    },
    {
      image: "/images/project.jpg",
      name: "لورم ایپسوم",
      subject: "لورم ایپسوم متن ساختگی",
      category: ["نوآوری", "سلامت"],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "#",
    },
    {
      image: "/images/project.jpg",
      name: "لورم ایپسوم",
      subject: "لورم ایپسوم متن ساختگی",
      category: [
        "نوآوری",
        "سلامت",
        "سرمایه‌گذاری",
        "کشف و خلق",
        "توسعه",
        "تجاری‌سازی",
        "سرمایه‌گذاری",
      ],
      status: "در حال توسعه",
      tags: ["نوآوری", "سلامت", "در حال توسعه"],
      href: "#",
    },
  ],
];

export const SELECT = [
  { label: "همه نمونه‌ها", value: "همه نمونه‌ها" },
  { label: "حوزه نوآوری", value: "نوآوری" },
  { label: "حوزه سلامت", value: "سلامت" },
  { label: "حوزه سرمایه‌گذاری", value: "سرمایه‌گذاری" },
  { label: "کشف و خلق", value: "کشف و خلق" },
  { label: "توسعه", value: "توسعه" },
  { label: "تجاری‌سازی", value: "تجاری‌سازی" },
  { label: "سرمایه‌گذاری", value: "سرمایه‌گذاری" },
];

export const TABS = [
  "همه نمونه‌ها",
  "حوزه نوآوری",
  "حوزه سلامت",
  "حوزه سرمایه‌گذاری",
  "کشف و خلق",
  "توسعه",
  "تجاری‌سازی",
  "سرمایه‌گذاری",
];
