// #############################################################################
// # Data
// #############################################################################

export const TIMELINE = [
  {
    number: "۰۱",
    title: "در مســــــــیر نوآوری",
    subTitle: "زیرساخت‌ها و راهکارهایی برای توانمندسازی اکوسیستم نوآوری",
    description: [
      "در این مسیر، ما به سازمان‌ها، پارک‌ها، دولت‌ها و نهادهای خصوصی کمک می‌کنیم تا محصولات، خدمات و پلتفرم‌هایی نوآورانه خلق کنند؛ از ارائه خدمات حرفه‌ای در قالب کشف، خلق و توسعه گرفته تا ساخت محصولات اختصاصی برای توانمندسازی بازیگران اکوسیستم نوآوری.",
      "در همین راستا، مجموعه‌ای از پلتفرم‌ها و راهکارهای نوآوری را طراحی کرده‌ایم که در قالب دروازه نوآوری اندیشه و با نام تجاری اینوگیت ارائه می‌شوند. در این دروازه، کاربر به تمام خدمات و ابزارهای تخصصی ما در زمینه نوآوری دسترسی دارد؛ از خرید خدمات سکوی نوآوری گرفته تا اکوسیستم مجازی و آکادمی نوآوری.",
    ],
    href: "#",
    text: "لینک دسترسی به اینوگیت",
  },
  {
    number: "۰۲",
    title: "در مســــــــیر سلامت",
    subTitle: "طراحی ساختاری پایدار برای سلامت آینده ایران با زی",
    description: [
      "در حوزه سلامت، نوآوری نیاز به درک عمیق حوزه پزشکی، قواعد حاکمیتی و حساسیت فرهنگی دارد. برای این هدف، ما استودیوی اندیشه را به بنیان‌گذاری یک شرکت مستقل رساندیم؛ راهکارهای سلامت زی.",
      "زی، شرکتی با سهام‌داری پزشکان، متخصصان، پژوهشگران و نوآوران حوزه سلامت است که هدفش طراحی و توسعه راهکارهای جامع در حوزه پایش سلامت فردی، تشخیص زودهنگام، پرونده الکترونیک سلامت و آگاهی‌رسانی عمومی است.",
      "این شرکت با بهره‌گیری از هوش مصنوعی، دانش بومی، ساختار شتابدهنده تخصصی سلامت و توجه جدی به مسئولیت اجتماعی، در حال ساخت پلتفرم‌هایی است که صنعت سلامت ایران را در مسیر «پیشگیری، تشخیص زودهنگام و سلامت پایدار» بازتعریف کند.",
    ],
    href: "#",
    text: "لینک دسترسی به زی",
  },
  {
    number: "۰۳",
    title: "در مســــــــیر سرمایه‌گذاری",
    subTitle: "سرمایه‌گذاری برای رشد واقعی و تجاری‌سازی",
    description: [
      "در اندیشه، سرمایه‌گذاری فقط به‌معنای تزریق منابع مالی نیست؛ بلکه بخشی از مسیر طراحی‌شده برای رشد واقعی کسب‌وکارهای نوآور است. ما در این مسیر، هم نقش مشاور را برای تیم‌هایی که به دنبال جذب سرمایه‌اند ایفا می‌کنیم، و هم به‌عنوان سرمایه‌گذار برای تیم‌هایی که در زنجیره ارزش ما قرار می‌گیرند وارد می‌شویم. سرمایه‌گذاری‌های اندیشه به‌صورت مرحله‌ای، شاخص محور و در بازه زمانی ۳۰ ماهه انجام می‌شود.",
      "تا امروز، تیم‌های متعددی وارد فرآیند ارزیابی استودیو اندیشه شده‌اند و سه سرمایه‌گذاری موفق از دل این مدل شکل گرفته است. برای دریافت اطلاعات بیشتر و ورود به این مسیر، کافی‌ست از طریق بخش «همراهی اندیشه» اقدام کنید.",
    ],
    href: "#",
    text: "لینک دسترسی به همراهی اندیشه",
  },
];
