// #############################################################################
// # Imports
// #############################################################################

// node_modules
import { type Metadata } from "next";

// src
import Faces from "@/components/layout/faces";
import Footer from "@/components/layout/footer";
import Title from "@/components/layout/title";
import Projects from "@/features/portfolio/components/projects";

// #############################################################################
// # Metadata
// #############################################################################

export const metadata: Metadata = {
  title: "آثار اندیشه",
  description:
    "مجموعه‌ای از پروژه‌ها و کسب‌وکارهای موفقی که با همراهی استودیو نوآوری اندیشه به ثمر نشسته‌اند. نمونه‌کارهای ما را در زمینه‌های مختلف مشاهده کنید.",
};

// #############################################################################
// # Components
// #############################################################################

export default function Portfolio() {
  return (
    <>
      <main>
        <Title
          title="آثار اندیشــــه"
          description="نمونه‌هایی از آن‌چه با اندیشه همراه شده آن‌چه در این بخش می‌بینید،
            صرفاً نمونه‌کار یا پروژه نیست؛ بلکه بازتابی است از فرآیندهای واقعی
            ساخت، آزمون، بازنگری و رشد.برخی از آثار اندیشه، در قالب شرکت‌های
            مستقل شکل گرفته‌اند. برخی دیگر، پروژه‌هایی‌اند که در قالب بسته‌های
            کشف، خلق، توسعه، تجاری‌سازی و سرمایه‌گذاری پیش رفته‌اند. همه این
            آثار، محصول همراهی با تیم‌هایی‌اند که انتخاب شدند، متعهد ماندند، و
            مسیر را تا ساختن طی کردند."
        />

        <Projects />

        <Faces />
      </main>

      <Footer />
    </>
  );
}
