// #############################################################################
// # Types
// #############################################################################

type Story = [
  string[],
  {
    count: number;
    text: string[];
  }[],
];

// #############################################################################
// # Data
// #############################################################################

export const BELIEFS = [
  {
    title: "بیانیه مأموریت",
    subTitle: "ما چه می‌سازیم و چرا؟",
    description:
      "ما ایده‌ها را به واقعیت تبدیل می‌کنیم؛ با طراحی، توسعه و تجاری‌سازی راه‌حل‌های پایدار. مأموریت ما اتصال نوآوران، کسب‌وکارها و سرمایه‌گذاران است، در مسیری که ریسک شکست را کاهش می‌دهد و کیفیت ورود به بازار را بالا می‌برد.",
  },
  {
    title: "بیانیه چشم‌انداز",
    subTitle: "به کدام آینده نگاه می‌کنیم؟",
    description:
      "ما آینده‌ای را می‌سازیم که در آن راه‌حل‌ها از مرزهای ذهنی و جغرافیایی عبور کنند و اثرگذاری واقعی، پایدار و انسانی داشته باشند. چشم‌انداز ما، نسل بعدی نوآوری‌هایی است که می‌شود با آن‌ها زندگی کرد، نه فقط سرمایه‌گذاری.",
  },
  {
    title: "مسئولیت اجتماعی",
    subTitle: "نوآوری، فقط خلق ثروت نیست",
    description:
      "ما مسئولیت اجتماعی را بخشی از هویت خود می‌دانیم. از توانمندسازی نسل Z تا آموزش‌های عمومی و ساخت ساختارهای انتقال تجربه با دانشگاه‌ها، مأموریت ما خلق فرصت برای آینده‌ای بهتر است؛ فرصتی برای همه، نه فقط برای سرمایه‌پذیران.",
  },
  {
    title: "فرهنگ کاری",
    subTitle: "ما چطور فکر می‌کنیم، چطور کار می‌کنیم",
    description:
      "در اندیشه، فرهنگ یعنی رفتار روزمره. ما با اعتماد متقابل، یادگیری پیوسته و گفت‌وگوی واقعی کار می‌کنیم. نه با ساختار خشک، بلکه با بلوغ. این فرهنگ بستر انسانی ما برای ساختن پروژه‌های واقع‌گرایانه است.",
  },
];

export const STORY: Story = [
  [
    "آبان ۱۳۹۹، در یک گفت‌وگوی دوستانه، کیان زارع، از نبود سرمایه‌گذار «خوب» می‌گفت و علی موسوی، مدیرعامل یک صندوق سرمایه‌گذاری، از سختی پیدا کردن تیم‌های «خوب» و قابل اعتماد. اینجا بود که یک سؤال کلیدی شکل گرفت که اصلا معنای «خوب» چیست؟ پاسخ روشن بود؛",
    "نه برای سرمایه‌گذار، نه برای سرمایه‌پذیر، تعریف دقیقی از «خوب» وجود نداشت. همان‌جا ایده‌ی شکل‌گیری بستری برای بازتعریف این رابطه متولد شد و کیان و غزاله قنبری، طراح تجربه کاربری، مدل‌هایی طراحی کردند که فرایند سرمایه‌گذاری و ساخت تیم را دوباره معنا می‌کرد. سپس بهزاد بوستانچی، توسعه‌دهنده‌ای با سابقه بین‌المللی در شرکت‌های بزرگی نظیر اپل، به جمع آن‌ها پیوست.",
    "در بهمن ۱۳۹۹، قرارداد هم‌بنیان‌گذاری استودیو اندیشه بین کیان، علی، غزاله و بهزاد بسته شد. در تیر ماه ۱۴۰۰، این تیم به عنوان یک هسته فناور در طرح شکوفایی پارک علم و فناوری دانشگاه تهران پذیرفته شد و در دی ماه ۱۴۰۱، استودیو اندیشه به‌عنوان شرکت رسمی ثبت شد.",
    "ما از ابتدا به دنبال ساختن یک نهاد تجاری نبودیم. هدفمان ساختن فضایی بود برای خلق فکرهایی که قرار نیست فقط ارائه شوند، بلکه باید ساخته شوند. مسیرمان پر از تردید، چالش و بازنگری بود، اما هر بار ما را به ساختار دقیق‌تری رساند.",
    "امروز، استودیو اندیشه فضای مشترکی است میان طراحان، توسعه‌دهندگان، کارآفرینان، پژوهشگران و سرمایه‌گذاران. جایی با یک فلسفه روشن؛ فلسفه‌ای که معقد است، خلق ارزش واقعی، نه از هیجان، بلکه از درک عمیق مسئله، جسارت در طراحی و انضباط در اجرا می‌آید.",
  ],
  [
    {
      count: 4,
      text: ["سال فعالیت حرفه‌ای", "ســـــــــــــال", "فعالیت حرفه‌ای"],
    },
    {
      count: 6,
      text: ["کسب و کار موفق", "کســــب و کار", "مــــــــوفــــق"],
    },
    {
      count: 50,
      text: ["فرصت شغلی ایجاد شده", "فرصت شــــغلی", "ایجــاد شــــده"],
    },
  ],
];

export const TIMELINE = [
  {
    year: "۱۳۹۹",
    details: [
      {
        month: "آبان",
        event: "شکل‌گیری ایده اولیه",
      },
      {
        month: "بهمن",
        event: "عقد قرارداد هم‌بنیانگذاری",
      },
    ],
  },
  {
    year: "۱۴۰۰",
    details: [
      {
        month: "تیر",
        event: "پذیرش در طرح شکوفایی پارک علم و فناوری دانشگاه تهران",
      },
      {
        month: "اسفند",
        event: "انتشار نسخه اول از اکوسیسم مجازی نوآوری",
      },
    ],
  },
  {
    year: "۱۴۰۱",
    details: [
      {
        month: "تیر",
        event: "طرح برگزیده رویداد تانا استان تهران",
      },
      {
        month: "آذر",
        event: "پذیرش در دوره رشد پارک علم و فناوری دانشگاه تهران",
      },
      {
        month: "دی",
        event: "تاسیس رسمی شرکت اندیشه خط سوم",
      },
    ],
  },
  {
    year: "۱۴۰۲",
    details: [
      {
        month: "اردیبهشت",
        event:
          "تفاهم راه‌اندازی اکوسیستم مجازی نوآوری با معاونت علمی ریاست جمهوری",
      },
      {
        month: "تیر",
        event: "رونمایی از اکوسیستم مجازی نوآری اندیشه",
      },
      {
        month: "اسفند",
        event: "استقرار در پارک علم و فناوری دانشگاه تهران",
      },
    ],
  },
  {
    year: "۱۴۰۳",
    details: [
      {
        month: "خرداد",
        event: "بازتعریف فعالیت‌های کلیدی استودیو",
      },
      {
        month: "مرداد",
        event: "طراحی دروازه نوآوری اندیشه",
      },
      {
        month: "شهریور",
        event: "راه‌اندازی اسپیناف حوزه سلامت دیجیتال",
      },
      {
        month: "مهر",
        event: "عضویت استودیو در نظام صنفی رایانه ای",
      },
      {
        month: "آبان",
        event: "راه‌اندازی اسپیناف حوزه اقتصاد نقره‌ای با برند ریشه",
      },
      {
        month: "دی",
        event: "جذب سرمایه راند اول برای پروژه ریشه",
      },
      {
        month: "بهمن",
        event: "دریافت مجوز مرکز مشاوره کسب و کار از وزارت صمت",
      },
    ],
  },
  {
    year: "",
    details: [
      {
        month: "",
        event: "",
      },
    ],
  },
  {
    year: "",
    details: [
      {
        month: "",
        event: "",
      },
    ],
  },
];

export const VALUES = [
  {
    number: "۱.",
    title: ["تفــــــــــــکر", "و خلاقیت"],
    description:
      "ما باور داریم که هر تحول و نوآوری از اندیشه آغاز می‌شود؛ به همین دلیل، تفکر خلاق و حل مسئله در قلب همه فعالیت‌های ماست.",
  },
  {
    number: "۲.",
    title: ["مسئولیت‌پذیری", "و تعهد"],
    description:
      "نسبت به تیم‌ها، پروژه‌ها و شرکای خود متعهدیم و مسئولیت موفقیت آن‌ها را به‌طور واقعی می‌پذیریم",
  },
  {
    number: "۳.",
    title: ["شــــــــفافیت", "و صداقت"],
    description:
      "در تمام همکاری‌ها، ارتباطات و تصمیم‌گیری‌ها شفاف، صادق و قابل اعتماد عمل می‌کنیم",
  },
  {
    number: "۴.",
    title: ["هم‌افــــــــزایی", "و مشارکت"],
    description:
      "اعتقاد داریم که موفقیت حاصل جمع توانمندی‌هاست. برای همین بر مشارکت هوشمندانه و رشد مشترک تمرکز داریم",
  },
  {
    number: "۵.",
    title: ["خــــــــــــــــلق", "ارزش پایدار"],
    description:
      "مأموریت ما فقط ساخت کسب‌وکار نیست؛ ما به دنبال ایجاد ارزش‌هایی هستیم که در بلندمدت برای جامعه، کسب‌وکارها و زیست‌بوم نوآوری ماندگار بماند",
  },
];
