// #############################################################################
// # Imports
// #############################################################################

// node_modules
import { type Metadata } from "next";

// src
import Footer from "@/components/layout/footer";
import Title from "@/components/layout/title";
import Components from "@/features/members/components";

// #############################################################################
// # Metadata
// #############################################################################

export const metadata: Metadata = {
  title: "اهالی اندیشه",
  description:
    "با اعضای تیم استودیو نوآوری اندیشه آشنا شوید. تیمی از متخصصان خلاق و متعهد که در کنار یکدیگر برای تحقق اهداف بزرگ تلاش می‌کنند.",
};

// #############################################################################
// # Components
// #############################################################################

export default function Members() {
  return (
    <>
      <main>
        <Title
          title="اهالی اندیشــــه"
          description="استودیو اندیشه را ساختارها نساخته‌اند، انسان‌ها ساخته‌اند. اینجا با
            چهره‌هایی آشنا می‌شوید که در شکل‌گیری، پیش‌برد و آینده‌ی اندیشه نقش
            دارند؛ از هم‌بنیان‌گذاران تا نسل جدیدی که در حال ساخت ادامه‌ی
            مسیرند."
        />

        <Components />
      </main>

      <Footer />
    </>
  );
}
